---
kind: method
id: M:Autodesk.Revit.DB.ConnectorSetIterator.#ctor
source: html/caebff74-0a85-bab7-38fb-cb04e0c37f55.htm
---
# Autodesk.Revit.DB.ConnectorSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ConnectorSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.